{
  "id": "8afc587b-e630-4708-96e7-641b4e2c03cc",
  "title": "Endless Space 2: Definitive Edition",
  "storefront": "Amazon",
  "protondb": "https://www.protondb.com/app/392110",
  "notes": "Native controller support. **Decky Plugin: Not Supported**. **2.0 Standalone: Works out of the box**.",
  "date_tested": "July '25",
  "proton_version": "",
  "dependencies": "",
  "controller_config": "",
  "performance_notes": "",
  "known_issues": "",
  "decky_rating": "not-supported",
  "standalone_rating": "green",
  "gog_url": "",
  "steamId": "392110",
  "publisher": "Sega",
  "developer": "Amplitude Studios",
  "genre": "Strategy, Turn-based strategy (TBS)",
  "description": "Endless Space 2 is Amplitude Studios’ third title in the acclaimed Endless Universe. This Strategic Space Opera is set in the mysterious universe of the “Endless”, God-like beings now long gone… though the secrets of their time still echo throughout the galaxy.\n\nBecome the leader of one of twelve unique factions as the benevolent guide your people need, or as a charismatic tyrant serving your own interests and building the influence of your empire.\n\nExplore the galaxy and encounter new life forms. Whether to befriend or to conquer them is up to you, regardless, you’ll need to build a strong fleet and adapt quickly to overcome those who cause a threat to your rule.\n\nWhichever route you choose, delve into this adventure in its most complete form with the Definitive Edition which, along with the base game, includes:\n\nEndless Space 2 – Vaulters\nThe resilient and stubborn Vaulters left the dying planet of Auriga for a new chance at finding a place they can finally call home.\n\nEndless Space 2 – Supremacy\nMeet the Hissho, a militaristic faction focused on expanding their empire and subjugating those who stand in their way.\n\nEndless Space 2 - Untold Tales\nEven if they are not the leading forces of the galaxy, minor factions still have their own heroes and their own stories: hear them out.\n\nEndless Space 2 - Lost Symphony\nThe Harmony are back. The travelers of this minor faction are experts at exploiting resources and will be invaluable allies. Also includes seven exclusive music tracks.\n\nEndless Space 2 - Harmonic Memories\nEnjoy nine remastered tracks from the original Endless Space as well as a new Harmony Hero: FES2 Reflects.\n\nEndless Space 2 - Celestial Worlds\nThe Leader of the Academy’s influence is wavering, and Restless Heroes start to rise… this epic multiple ending questline will make each of your decisions count.\n\nEndless Space 2 – Penumbra\nThe Umbral Choir faction does not usually meddle with the rest of the denizens of the galaxy, but even they cannot ignore its death cry.\n\nEndless Space 2 – Awakening\nThe Nakalim faction was once a vast galactic empire under the guidance of their gods, the Lost. When the Lost were slain, the Nakalim fell from grace. They now seek to reclaim their ancient territories.\n\nEndless Space 2 - Dark Matter\nWith twelve new story quests, investigate ancient mysteries and… less ancient problems caused by unruly subjects of your empire.",
  "game_modes": [
    "Single player",
    "Co-operative",
    "Multiplayer"
  ],
  "languages": [
    "English"
  ],
  "updated_at": "2025-08-11T19:59:03.541Z",
  "exported_at": "2025-08-13T20:50:39.628Z"
}