{
  "id": "965c39fd-87fa-41b3-a719-ba8ffe902736",
  "title": "Faraway 2: Jungle Escape",
  "storefront": "Amazon",
  "protondb": "https://www.protondb.com/app/1747680",
  "notes": "Keyboard & mouse controls. **Decky Plugin: Not Supported**. **2.0 Standalone: Works out of the box**.",
  "date_tested": "July '25",
  "proton_version": "",
  "dependencies": "",
  "controller_config": "",
  "performance_notes": "",
  "known_issues": "",
  "decky_rating": "not-supported",
  "standalone_rating": "green",
  "gog_url": "",
  "steamId": "1747680",
  "publisher": "NIL, NIL",
  "developer": "Pine Studio",
  "genre": "Adventure, Puzzle",
  "description": "Escape all new temples in Faraway 2: Jungle Escape that are full of new challenges and mysterious puzzles. This room escape game will surely challenge your puzzle escaping ability. Sequel to one of the best escape games ever with over a million players! A room escape puzzle game that will completely challenge your mind, captivate you & offer hours of amazing mobile gaming entertainment.\n\nCOMPLEX PUZZLES\nExplore 18 new temples packed with escape puzzles, Explore a 3D world that will captivate you from the moment you begin. Turn, look and explore mind-bending puzzles and contraptions.\n\nIMMERSIVE WORLD\nRelax to the ambient soundtrack and the easy to navigate the 3D world that you will find in an escape game, with an abundance of secrets to discover.\n\nTHE MYSTERY CONTINUES\nYou have many more pages of your father’s missing journal to find, maybe then you will unlock your family’s past. This is an escape game that will keep you engaged for many hours!\n\nNEW FEATURES\nIn game camera allows you to take snapshots and save them for later use.\n\nTRY FOR FREE\nEnjoy 9 free escape levels before you decide to purchase the remaining levels and experience the whole Faraway 2: Jungle Escape story that will leave you impressed.\n\nSUPER WIDESCREEN SUPPORT\nThe puzzle game looks beautiful on new 18:9 phones and also shines on tablet devices. Enjoy stunning and astoundingly detailed graphics that look exquisite.\n\nSUPPORTS IPHONE X SCREEN\nCompatible with new standard screen sizes for iPhone X.\n\nEnter an all-new intriguing environment of room escape games & puzzles with Faraway 2: Jungle Escape!",
  "game_modes": [],
  "languages": [
    "English"
  ],
  "updated_at": "2025-08-11T19:59:32.841Z",
  "exported_at": "2025-08-13T20:50:39.628Z"
}