{
  "id": "1c4d956b-d06e-4aa1-a7b1-26901fdec228",
  "title": "Max: The Curse of Brotherhood",
  "storefront": "Amazon",
  "protondb": "https://www.protondb.com/app/255390",
  "notes": "Native controller support. **Decky Plugin: Not Supported**. **2.0 Standalone: Works out of the box**.",
  "date_tested": "July '25",
  "proton_version": "",
  "dependencies": "",
  "controller_config": "Native Steam Deck Controls",
  "performance_notes": "",
  "known_issues": "",
  "decky_rating": "not-supported",
  "standalone_rating": "green",
  "gog_url": "",
  "steamId": "255390",
  "publisher": "Microsoft Studios, Wired Productions, Flashbulb Games, Stage Clear Studios",
  "developer": "Press Play, Flashbulb Games, Stage Clear Studios",
  "genre": "Adventure, Platform, Puzzle",
  "description": "In its core Max: The Curse of Brotherhood is a physics-based puzzle/platformer and set in a 2.5D environment with a free and cinematic camera. The game has 7 chapters and 20 levels in total All levels are connected so the game feels like one long journey. Besides platforming, the gameplay twist is the magic marker which introduces a creative and open approach to how puzzles can be solved. Throughout the game the magic marker will gain different powers.\n\nThe five powers are\n1. Earth pillars. You can create pillars from the earth to reach higher grounds.\n2. Tree branches - You can grow trees to use them as platforms, springboards, rafts and moveable objects. Branches also catch fire.\n3. Vines which work like ropes. You can crawl and swing in vines, but vines can also be used to tie objects together.\n4. Water streams can be shaped freely and will move objects as well as Max along their path.\n5. You must destroy obstacles and defeat Mustacho’s minions.\n\nEach of the five powers are introduced in settings similar to the power themselves. The magic marker is triggered by pressing and holding RT and controlled by the right analog stick of the Xbox One controller and while controlling the magic marker Max cannot move at all.",
  "game_modes": [
    "Single player"
  ],
  "languages": [
    "English"
  ],
  "updated_at": "2025-08-11T02:21:23.713Z",
  "exported_at": "2025-08-13T20:50:39.628Z"
}