{
  "id": "942bf43a-0b13-475c-9f79-243732874745",
  "title": "Diggles: The Myth of Fenris",
  "storefront": "GOG",
  "protondb": "https://www.protondb.com/app/1478650",
  "notes": "Requires manual controller/key mapping. **Decky Plugin: Some tinkering required**. **2.0 Standalone: Some tinkering required**.",
  "date_tested": "Nov '24",
  "proton_version": "",
  "dependencies": "",
  "controller_config": "",
  "performance_notes": "",
  "known_issues": "",
  "decky_rating": "yellow",
  "standalone_rating": "yellow",
  "gog_url": "https://www.gog.com/en/game/diggles_the_myth_of_fenris",
  "steamId": "1478650",
  "publisher": "Innonics, CD Projekt",
  "developer": "SEK",
  "genre": "Adventure, Strategy, Real Time Strategy (RTS)",
  "description": "Godfather Odin has chosen the Diggles to set out on a long and burdensome expedition to the center of the earth where the hound of hell, Fenris, spreads terror. Fenris was once Odin's watchdog and ran away. Ever since he became aware of his growing power and strength he has been terrifying the underground world. Fenris must be disarmed and put on a chain. This task requires a very special chain, a chain that can only be forged by the Diggles...\n\nAccomplishing this dangerous mission will take decades and involved many generations of dwarves. During their journey the dwarves have to pass through 4 different worlds and more than 100 different quests have to be solved. The player has to arrange a daily schedule for the dwarves by determining how much they work and what they do in their leisure time. The player has to teach them how to forge weapons, cook mushrooms, raise hamsters, produce tools and invent machines. Like people in real life, the dwarves also want to have some spare time in order to sleep, eat, play cards, go bowling or to a pub. Male and female Diggles can even fall in love with each other and thus conceive their offspring, which ensures the survival of their clan and can transmit their learned attributes to their dwarf children. The player's most important goal is to prepare the Diggles for the crucial fight with Fenris.",
  "game_modes": [
    "Single player",
    "Multiplayer"
  ],
  "languages": [
    "English"
  ],
  "updated_at": "2025-08-11T07:51:32.265Z",
  "exported_at": "2025-08-13T20:50:39.616Z"
}