{
  "id": "1212edc2-40d6-4fc9-ba4b-6d5e6f4f8f53",
  "title": "Middle-earth: Shadow of Mordor",
  "storefront": "GOG",
  "protondb": "https://www.protondb.com/app/241930",
  "notes": "Native controller support **Decky Plugin: Works out of the box**. **2.0 Standalone: Works out of the box**.",
  "date_tested": "Sept '24",
  "proton_version": "",
  "dependencies": "",
  "controller_config": "Native Steam Deck Controls",
  "performance_notes": "",
  "known_issues": "",
  "decky_rating": "green",
  "standalone_rating": "green",
  "gog_url": "https://www.gog.com/en/game/middleearth_shadow_of_mordor",
  "steamId": "241930",
  "publisher": "WB Games",
  "developer": "Monolith Productions",
  "genre": "Role-playing (RPG), Adventure, Hack and slash/Beat 'em up",
  "description": "Middle-earth: Shadow of Mordor is a open world third-person action role-playing video game developed by Monolith Productions and published by Warner Bros. Interactive Entertainment, which takes place in the world of J.R.R. Tolkien's Legendarium.\n\nThe game takes place in the 60-year gap between the events of Tolkien's The Hobbit and The Lord of The Rings. It is a story of revenge, slaughter, and mystery set entirely in Mordor, the Land of Shadows. At its center is Talion, an ordinary man who loses everything, including his mortal life.\n\nThe game is set in a fully open world, and features various role-playing game elements such as experience points and skills. There are various ways the player can complete their main objective. Aside from the main storyline, there are various side quests and random events the player can complete within Mordor.\n\nThe melee system is inspired by that of the Batman Arkham series. Getting into a good fighting rhythm, using both regular attacks and counter-attacks will improve the player's combo multiplier.\n\nA unique feature of Middle-earth: Shadow of Mordor is the Nemesis system. Every enemy in the game has their own name, rank, and memory. These enemies will continue to do their own jobs and tasks even when they're off screen. If the player does not kill an enemy in an encounter, this enemy will remember the player and change their tactics and conversations based on the encounter.",
  "game_modes": [
    "Single player"
  ],
  "languages": [
    "English"
  ],
  "updated_at": "2025-08-01T04:08:36.968Z",
  "exported_at": "2025-08-13T20:50:39.620Z"
}