{
  "id": "438b3189-2dfc-4a11-8d3c-00da411ceddc",
  "title": "Star Wars Jedi Knight: Dark Forces II",
  "storefront": "GOG",
  "date_tested": "July '25",
  "decky_rating": "yellow",
  "standalone_rating": "yellow",
  "proton_version": "",
  "images": {
    "vertical_artwork": "https://images.gog.com/56a54de2e31582d9b540304522dcf719d5ae21fcde6dbebea289b34e8a11e75f.jpg?namespace=gamesdb",
    "banner_image": "https://images.gog.com/26b1f2f4eb622fb14ca161bf54ce57597fbc93a4d58730944fcbcd3b9a696dde.jpg?namespace=gamesdb",
    "icon_image": "https://images.gog.com/89a02e63aa2ba63e854204a53345e311cfafac0dcf17c4d5686f45199acbe779.jpg?namespace=gamesdb",
  },
  "publisher": "Disney",
  "developer": "Lucasfilm",
  "genre": "Shooter",
  "releasedate": "1998-02-24T00:00:00+0000",
  "description": "Jedi Knight: Dark Forces II includes  Jedi Knight: Dark Forces II and  Jedi Knight - Mysteries of the Sith.\nWhatever path Kyle Katarn chooses will change the face of the galaxy forever.\n Jedi Knight: Dark Forces II continues the story of Kyle Katarn, a young mercenary that successfully infiltrated the Empire, as he embarks on a quest to discover his past and learn the ways of the Jedi. In order to protect the galaxy Katarn must confront his father's murderers, led by the Dark Jedi Jerec, and stop them from obtaining the mysterious powers of a \"Valley of the Jedi\", a focal point for Jedi power and a Jedi burial ground. As Katarn embarks on his journey to defeat the Dark Jedi he must also shape his destiny, by choosing to follow either the light side, or the dark side.\n<br><br>\n<b>Mysteries of the Sith</b>\n<br><br>\nKyle Katarn's adventures continue five years after the events in Dark Forces II. Invading Imperial forces advance upon a quiet Rebel outpost, interrupting Kyle's trianing of a brave new Jedi, Mara Jade. First introduced in Timothy Zahn's award-winning Star Wars™ novel, Heir to the Empire, Mara Jade combines her experiences as a smuggler and Emperor's Hand with her apprenticeship as a Jedi Knight. Mara's training will continue in the field as she makes use of four new weapons and five new Force™ powers to secure supplies for the New Republic. Meanwhile, Kyle pursues what he believes to be his destiny as he searches for secret treasures in an ancient Sith temple. Will you uncover the Mysteries of the Sith?",
  "size": "",
  "epic_features": null,
  "dependencies": "",
  "controller_config": "",
  "controller_input": "requires-mapping",
  "set_executable": "",
  "required_launcher": "",
  "requires_account_setup": false,
  "account_type": "",
  "steamId": "32380",
  "protondb": "https://www.protondb.com/app/32380",
  "is_featured": false,
  "cant_test_linux": false,
  "notes": "Requires manual controller/key mapping. **Decky Plugin: Some tinkering required**. **2.0 Standalone: Some tinkering required**.",
  "performance_notes": "",
  "known_issues": "",
  "created_at": "2025-08-01T02:40:48.193Z",
  "updated_at": "2025-08-11T07:15:40.487Z"
}