{
  "id": "14caa3fd-7d47-4fa1-b91f-a43c08c679a4",
  "title": "Armored Warfare",
  "storefront": "Epic",
  "protondb": "https://www.protondb.com/app/443110",
  "notes": "Keyboard & mouse controls. **Decky Plugin: Works out of the box**. **2.0 Standalone: Works out of the box**.",
  "date_tested": "Aug '24",
  "proton_version": "",
  "dependencies": "",
  "controller_config": "",
  "performance_notes": "",
  "known_issues": "",
  "decky_rating": "green",
  "standalone_rating": "green",
  "gog_url": "",
  "steamId": "443110",
  "publisher": "Wishlist Games",
  "developer": "Obsidian Entertainment",
  "genre": "Adventure, Strategy, Shooter, Simulator, Racing, Tactical",
  "description": "Armored Warfare, is a free-to-play massively multiplayer online tactical military video game that puts you in control of some of the most incredible, modern destructive machines to grace a battlefield. Drive modern tanks, armored vehicles and more.\n\nMODERN MILITARY HARDWARE\nUse steel giants to wipe the enemy from the face of the earth! Operate the most powerful tools of destruction invented by mankind: heavily armed tanks and artillery.In Armored Warfare you will be able to drive and do battle in the mightiest armored vehicles from dozens of countries around the world.\n\nJOIN CO-OP MISSIONS\nTeam up with friends to carry out the most difficult missions sent down to you by command. These missions will differ depending on the vehicle selected. Only well coordinated squads will be able to outwit the enemy! The enemy's superior forces, controlled by artificial intelligence, will present a serious obstacle to victory.\n\nMODERN GRAPHICS\nArmored Warfare uses CryENGINE 3 technology, which ensures the feeling of complete immersion in the game. See the glare in the crosshairs, the spray from water hazards, drops of rain shrouding the enemy, smoking ruins and other obstacles - step into a virtual world that is in no way inferior to reality!\n\nLARGE-SCALE BATTLES\nEngage in challenging, fast-paced player versus player combat. Collaborate with your allies and execute clever tactics and maneuvers to emerge from battle victorious and your enemies ground beneath your treads. Armored Warfare is easy to learn, but challenging to master.\n\nMODERN BATTLEFIELD\nFight in hotspots around the world from frozen tundras to sun-scorched deserts. Do battle in locations that might be the focus of a modern military conflict, such as oil refineries, port facilities and population centers. Bring the fight to the 21st Century.",
  "game_modes": [
    "Single player",
    "Co-operative",
    "Multiplayer",
    "Massively Multiplayer Online (MMO)"
  ],
  "languages": [
    "English"
  ],
  "updated_at": "2025-08-11T06:36:09.650Z",
  "exported_at": "2025-08-13T20:50:39.592Z"
}