{
  "id": "9905978c-8262-4e86-b8d3-3f8db0ab149c",
  "title": "Crystal of Atlan",
  "storefront": "Epic",
  "protondb": "https://www.protondb.com/app/3839850",
  "notes": "There are a few steps to get this working in game mode. Best is to do this all in desktop/Big Picure mode through Junk Store before hopping back into Game mode. Tested with Proton Experimental.<br> - First download the game in Junk Store then launch the game once to set a prefix<br> - You then need to install  the pdh dependency, I used Protontricks from desktop mode<br> - Once the depedency is installed, go back into Big Picture mode and before launching the game set the exe to <strong>./Crystal of Atlan.exe</strong> (remember to push X to save) then launch the game.<br> - This next part took me a few goes. The game may load to a black screen and seem stuck, just be patient as it's loading and you'll see the game splash screen eventually.<br> - Once the game loads and says <em>Click anywhere to proceed</em> do that and then you need to wait for an age verification box to open. This is what didn't always load properly, you get a white screen and may need to move the mouse around for it to show. Once you click confirm for age verification the game should load and you can play.<br> - Once you get to playing the game in desktop/big picture mode it should now load without issue in game mode. It seems to have full controller support too.",
  "date_tested": "July '25",
  "proton_version": "",
  "dependencies": "pdh dependency",
  "controller_config": "Native Steam Deck Controls",
  "performance_notes": "",
  "known_issues": "",
  "decky_rating": "yellow",
  "standalone_rating": "yellow",
  "gog_url": "",
  "steamId": "3839850",
  "publisher": "Skystone Games, Nuverse Games",
  "developer": "Nuverse Games",
  "genre": "Role-playing (RPG), Adventure, Hack and slash/Beat 'em up",
  "description": "Crystal of Atlan is a Magipunk MMO Action RPG! As a member of the Adventurer's Guild, you'll be missioned to explore the world of Atlan and gradually unveil the mysteries around the Crystals of Atlan, the source of all energy in the world!",
  "game_modes": [
    "Single player",
    "Co-operative",
    "Multiplayer",
    "Massively Multiplayer Online (MMO)"
  ],
  "languages": [
    "English"
  ],
  "updated_at": "2025-08-04T20:37:37.065Z",
  "exported_at": "2025-08-13T20:50:39.597Z"
}