{
  "id": "4c6ff2fe-b2d8-47dd-ae14-304d3edb6b11",
  "title": "LEGO Star Wars: The Skywalker Saga",
  "storefront": "Epic",
  "protondb": "https://www.protondb.com/app/920210",
  "notes": "May need to verify with Epic account before launch. Epic achievements working. Native controller support. **Decky Plugin: Works out of the box**. **2.0 Standalone: Works out of the box**.",
  "date_tested": "Dec '24",
  "proton_version": "",
  "dependencies": "",
  "controller_config": "",
  "performance_notes": "",
  "known_issues": "",
  "decky_rating": "green",
  "standalone_rating": "green",
  "gog_url": "",
  "steamId": "920210",
  "publisher": "WB Games",
  "developer": "Traveller's Tales",
  "genre": "Adventure, Puzzle",
  "description": "Lego Star Wars: The Skywalker Saga is a third-person action-adventure with an open world hub. Unlike previous Lego games in which players had to advance through the story in a linear order, players can now choose to start the game from any of the main Skywalker Saga episodes and complete them in any order they wish. Each episode has their own hub filled with planets featured prominently in each respective film that can be visited and explored. Each episode will have five story missions each, a total of 45 levels.\n\nCombat has also been revamped, such as lightsaber fights now involving a variety of combos with light attacks, heavy attacks, and Force moves, and blaster characters having an over-the-shoulder camera angle featured in many third-person shooter games.\n\nRandom encounters will also happen in the game's hub. For example, an Imperial Star Destroyer will suddenly jump out of hyperspace and send a fleet of TIE Fighters after the player. Players can choose to engage in dogfights with them or continue onward to progress the story. The game will have more than 200 playable characters, though TT Games has said that number will change.",
  "game_modes": [
    "Single player",
    "Co-operative",
    "Multiplayer",
    "Split screen"
  ],
  "languages": [
    "English"
  ],
  "updated_at": "2025-08-11T07:31:39.174Z",
  "exported_at": "2025-08-13T20:50:39.604Z"
}