{
  "id": "dfed0a5b-7def-4924-a40a-77a35b86c58f",
  "title": "Metro: Last Light Redux",
  "storefront": "Epic",
  "protondb": "https://www.protondb.com/app/287390",
  "gog_url": "",
  "epic_url": "",
  "itch_url": "",
  "notes": "Native controller support **Decky Plugin: Works out of the box**. **2.0 Standalone: Works out of the box**.",
  "date_tested": "Sept '24",
  "decky_rating": "green",
  "standalone_rating": "green",
  "proton_version": "",
  "dependencies": "",
  "controller_config": "Native Steam Deck Controls",
  "performance_notes": "",
  "known_issues": "",
  "requires_eos": false,
  "supports_eos": false,
  "requires_verification": false,
  "epic_achievements": false,
  "epic_offline_mode": false,
  "must_be_online": false,
  "requires_eac_runtime": false,
  "requires_battleye_runtime": false,
  "required_launcher": "",
  "requires_account_setup": false,
  "account_type": "",
  "controller_input": "native",
  "community_layout": false,
  "cant_test_linux": false,
  "databaseId": "Speedwell",
  "shortname": "Speedwell",
  "publisher": "Deep Silver, Koch Media",
  "developer": "4A Games",
  "releasedate": "2014-08-26T00:00:00+0000",
  "genre": "Role-playing (RPG), Shooter",
  "description": "Metro: Last Light Redux is the definitive version of the critically acclaimed ‘Metro: Last Light’, rebuilt in the latest and greatest iteration of the 4A Engine for Next Gen. Newcomers will get the chance to experience one of the finest story-driven shooters of all time; an epic adventure combining gripping survival horror, exploration and tactical combat and stealth. \n \nThis definitive version also includes all previously released DLC, adding 10 hours of bonus single-player content to the huge solo campaign. Fans of the original game will notice new features and gameplay improvements, including new melee animations, the ability to check your watch and ammo supplies on the fly, and new full-body player animations. \n \nAnd those who favoured the more survival-horror oriented gameplay of the cult prequel ‘Metro 2033’ will find a new way to experience the campaign thanks to the introduction of two unique Play Styles – Survival and Spartan. The former transforms Last light from a more action-oriented stealth combat experience to a fraught, slow burn fight for survival. With the legendary Ranger Mode included to offer an extra layer of challenge and immersion, Metro: Last Light Redux offers hours of AAA gameplay for an incredible price. \n \nGame Features \n \nImmerse yourself in the Moscow Metro - witness one of the most atmospheric worlds in gaming brought to life with stunning next-gen visuals at 60FPS Brave the horrors of the Russian apocalypse - equip your gasmask and an arsenal of hand-made weaponry as you face the threat of deadly mutants, human foes, and the terrifying environment itself \n   \nRebuilt and Remastered for next-gen - with all previous DLC content included, new modes and features, and many gameplay improvement, this is the definitive version of the critically acclaimed classic that fans and newcomers alike will enjoy \n   \nTwo unique Play Styles : \"Spartan\" and \"Survival\" - approach the game as a slow burn Survival Horror, or tackle it with the combat skills of a Spartan Ranger in these two unique modes \n   \nThe legendary Ranger Mode returns - dare you play the fearsome Ranger Mode? No HUD, UI, deadlier combat and limited resources combine to create the ultimate immersive experience \n  \nBased on the internationally bestselling novel series by Dmitry Glukhovsky",
  "size": "",
  "vertical_artwork": "https://images.gog.com/d1bca392cb9e83d537c68dc3f3ac464ae67e85aca0e9694aca29b04736b6199f.jpg?namespace=gamesdb",
  "banner_image": "https://images.gog.com/80496b9540e10004637cada016191f5f78235c8f5a98c2aae17dcb7193df76b2.jpg?namespace=gamesdb",
  "icon_image": "",
  "steamId": "287390",
  "game_modes": [
    "Single player"
  ],
  "languages": [
    "English"
  ],
  "owned": true,
  "is_featured": false,
  "created_at": "2025-08-01T02:40:48.201Z",
  "updated_at": "2025-08-01T04:08:36.968Z"
}