{
  "id": "87b95565-12e8-464d-8ba5-cca48d52a79a",
  "title": "Mortal Shell",
  "storefront": "Epic",
  "protondb": "https://www.protondb.com/app/1110910",
  "gog_url": "",
  "epic_url": "",
  "itch_url": "",
  "notes": "Native controller support **Decky Plugin: Works out of the box**. **2.0 Standalone: Works out of the box**.",
  "date_tested": "March '25",
  "decky_rating": "green",
  "standalone_rating": "green",
  "proton_version": "",
  "dependencies": "",
  "controller_config": "Native Steam Deck Controls",
  "performance_notes": "",
  "known_issues": "",
  "requires_eos": false,
  "supports_eos": false,
  "requires_verification": false,
  "epic_achievements": false,
  "epic_offline_mode": false,
  "must_be_online": false,
  "requires_eac_runtime": false,
  "requires_battleye_runtime": false,
  "required_launcher": "",
  "requires_account_setup": false,
  "account_type": "",
  "controller_input": "native",
  "community_layout": false,
  "cant_test_linux": false,
  "databaseId": "0055e45ce7654c55aade646467349e83",
  "shortname": "0055e45ce7654c55aade646467349e83",
  "publisher": "Playstack",
  "developer": "Cold Symmetry",
  "releasedate": "2020-08-18T00:00:00+0000",
  "genre": "Role-playing (RPG), Indie",
  "description": "Mortal Shell is a ruthless and deep action-RPG that tests your sanity and resilience in a shattered world. Your adversaries spare no mercy, with survival demanding superior awareness, precision and instincts. Possess lost warriors, track down hidden sanctums of the devout, and face formidable foes.\n\n\"Awakening as an empty vessel, you will enter into a shattered and twisted world where the remains of humanity wither and rot. Implored to do the bidding of the mysterious “Dark Father”, you must traverse this tattered landscape and track down hidden sanctums of devout followers. There, in Mortal Shell’s most hallowed grounds, you must overcome formidable foes and harvest the sacred glands. You won’t be truly alone when the dead litter your path: Scattered across this land are the remnant anima of lost warriors who can be inhabited to gain their unique abilities and knowledge of weapons. The Dark Father is desperate for you to complete your task — but to what end?\n\nDiscover “Shells” to Suit Your Playstyle - The lost remains of defeated warriors are yours to unearth. Awaken these Mortal Shells, occupy their bodies and significantly widen your understanding of different forms of combat. Inhabit a Shell that best fits your style and utilizes their own unique mastery of skills and weapon\nupgrades.\n\nIron Sharpens Iron - Combat is strategic and deliberate. Survival demands superior awareness, precision and instincts. You must commit your sword only when an opportunity opens. Calculate your parries to unleash devastating counterblows.\n\nNon-linear Campaign - Draw your own path across marsh-infested lowlands, through a gargantuan cathedral of obsidian rock, and into an ancient crypt frozen into the crest of a mountain.\n\nDeep Upgrade Paths - The stronger your connection to each Mortal Shell grows, the better you can harness their innate talents. Craft unique upgrades, sharpen your blade with acid, and study dark arcane abilities that imbue your attacks with supernatural devastation.\n\nFace Haunting Foes - Your path is guarded by desperate adversaries, devoted to inscrutable gods. Behold creatures both pitiable and grotesque, but do not let fear halt your journey. Muster your courage and face them down.\n\nDeveloped by AAA Veterans - Mortal Shell has been developed by a coalition of seasoned veterans with an unbridled passion for the soulslike genre.\"",
  "size": "",
  "vertical_artwork": "https://images.gog.com/c5ba8aca686f0e168bb35a3bad3a2b1b48a4051421a53ff12c5fd6bcc348c920.jpg?namespace=gamesdb",
  "banner_image": "https://images.gog.com/5b7bd64fc88d31c49123baeaf1e986e0136c0fab6c44ef8c275a358d2a58dbef.jpg?namespace=gamesdb",
  "icon_image": "https://images.gog.com/652afb5ec636a1c0e89913fd5dcc65bd138c2a9cf6a8ef001a9f1d3371dd0afd.jpg?namespace=gamesdb",
  "steamId": "1110910",
  "game_modes": [
    "Single player"
  ],
  "languages": [
    "English"
  ],
  "owned": true,
  "is_featured": false,
  "created_at": "2025-08-01T02:40:48.201Z",
  "updated_at": "2025-08-01T04:08:36.968Z"
}