{
  "id": "d59709cc-f9d7-46f5-8568-68a7f0cc1d01",
  "title": "Super Meat Boy Forever",
  "storefront": "Epic",
  "protondb": "https://www.protondb.com/app/581660",
  "gog_url": "",
  "epic_url": "",
  "itch_url": "",
  "pc_gaming_wiki_url": "",
  "notes": "Native controller support. **Decky Plugin: Some tinkering required**. **2.0 Standalone: Some tinkering required**. Does have an audio issue that you need to install xact and d3dx9.27 to fix.",
  "date_tested": "Feb '25",
  "decky_rating": "yellow",
  "standalone_rating": "yellow",
  "proton_version": "",
  "dependencies": "",
  "controller_config": "",
  "performance_notes": "",
  "known_issues": "",
  "requires_eos": false,
  "supports_eos": false,
  "requires_verification": false,
  "epic_achievements": false,
  "epic_offline_mode": false,
  "must_be_online": false,
  "requires_eac_runtime": false,
  "requires_battleye_runtime": false,
  "required_launcher": "",
  "requires_account_setup": false,
  "account_type": "",
  "controller_input": "native",
  "community_layout": false,
  "cant_test_linux": false,
  "databaseId": "Moose",
  "shortname": "Moose",
  "publisher": "Team Meat, Thunderful",
  "developer": "Team Meat",
  "releasedate": "2020-12-23T00:00:00+0000",
  "genre": "Adventure, Indie, Platform, Puzzle",
  "description": "Meat Boy and Bandage Girl have grown as a couple since 2010. It seems like only yesterday the two love birds were escaping from an exploding laboratory in the sky. Now it’s the current year, and they’ve welcomed their daughter Nugget into the world. Their peaceful days enjoying life as a family came to an abrupt end when Dr. Fetus beat the snot out of them with a rusty shovel, and kidnapped Nugget! Now it’s up to Meat Boy and Bandage Girl to rescue their daughter from a lunatic fetus in a jar that can only be described as an incel version of Tony Stark.\n\n- Super Meat Boy Forever is the sequel to Super Meat Boy! This is a new experience that eclipses the original. Don’t stare directly at it unless you still have your eclipse glasses.\n- 7200 individually handcrafted levels combine dynamically to give you a new challenge every single time you play. Seven thousand two hundred levels. They said we couldn’t do it, but we did. Who’s they? Don’t ask. They don’t like it when you ask.\n- It’s hard, but fair. Nothing in life worth having comes easy. Just ask Dark Soulman.\n- Meat Boy and Bandage Girl can fight back. It’s time to unleash the raw fury of parenthood on their foes just like Liam Neeson in that documentary about his family vacation in Paris.\n- Bigger boss battles than before. Your mind will be blown. Your socks will be blown off. Team Meat is not liable for any of this.\n- Brand new art with stunning detail and resolution. There are a lot of pixels in here. Grab the biggest display you have and watch those dots change color rapidly with gumption. Don’t sit too close though. (If your parents aren’t home you can sit as close as you want we won’t tell, but Team Meat is still not liable for any of this.)\n- A soundtrack composed by Ridiculon so intense that the state of Wyoming has issued a ban on all audio devices capable of playing it out of fear that just a single note will cause the dormant super volcano beneath Yellowstone to erupt ushering in a new age of darkness.\n- Frame by frame artisan crafted in game animations, and animated cutscenes that will make you experience procedurally generated emotions.\n- A story so rich and moving that it makes Citizen Kane look like an unboxing video for a dehumidifier.",
  "size": "",
  "vertical_artwork": "https://images.gog.com/8b06b1812306e9a8a0308c524a1ad913eac1423e34b1eb0291407d5539308040.jpg?namespace=gamesdb",
  "banner_image": "https://images.gog.com/9ab1e2e242d0c8eb5a7c9061047cd145942cb3e108b2de0302869a607a619ba1.jpg?namespace=gamesdb",
  "icon_image": "https://images.gog.com/8c0c9d3709c03fed2dc3802a2c1d28c10f4393f0ca401a315b49669152176600.jpg?namespace=gamesdb",
  "steamId": "581660",
  "game_modes": [
    "Single player"
  ],
  "languages": [
    "English"
  ],
  "epic_cloud_saves": false,
  "tested": true,
  "owned": true,
  "is_featured": false,
  "blog_category": "",
  "created_at": "2025-08-01T02:40:48.201Z",
  "updated_at": "2025-08-11T07:33:32.923Z"
}